'use strict'
/*
Задание 6

Есть массив произвольных чисел:
let numbers = [42, 65, 49, 68, 56, 47, 70, 42, 51, 35, 58, 63, 40, 70]


1) Посчитать и вывести в консоль сумму элементов в массиве.



Подсказка: в задачах такого типа нужно заранее предусмотреть переменную (например, sum)
 и записать в нее начальное значение (в случае с суммой - ноль). Затем уже описать цикл, 
 в котором эта сумма будет считаться (в каждой итерации цикла к ней будет прибавляться следующий элемент массива).

2) Посчитать и вывести в консоль сумму четных элементов в массиве.



3) Найти и вывести в консоль максимальное число массива.



Подсказка: как и в случае с суммой, здесь сначала нужно объявить переменную (например, max), 
записать в нее первый элемент массива, а затем уже в цикле искать максимальное значение.



4) Определить и вывести в консоль индекс максимального числа массива 
(или индексы, если число встречается более одного раза). 
Само максимальное число мы уже нашли в прошлой части задачи, повторно его искать не нужно.

*/