"use strict"
alert('Hello')
    //цикл form
for (let i = 0; i < 3; i++) { //сначало нужно создать переменную i
    //которой присвоить значение 0
    alert('Hi') //затем, выполнить вот этот блок кода
        //после увеличиваем значение переменной
        // и проверить , является ли она меньше трех
}

//детально

let num = 0; // 1.шаг - создаем переменную i, со значением 0
if (i < 3); { // 2.шаг - проверяем является ли она меньше трех
    alert('Hi'); // если является, то выводит HI
    i++ //затем, выполнить вот этот блок кода, прибавляет 1 к значению  i
    //i=1
} // в этот код больше не возвращаемся
if (i < 3); { //дальще снова проверям  i= 1(стала единица) < 3
    alert('Hi');
    i++ // в итоге i =2
}

if (i < 3); {
    alert('Hi');
    i++ // i =3
    //оператор, прибавляет 1 к значению инача i= i+1
}

//когда i = 3, то конец цикла

let num2 = 10;
for (let i = 0; i < 10; i++) {
    if (num == 11) {
        num2++;
        console.log(num2);
    }
}